1   Russian
Ты искупил мир от греха,
И дал ему любовь и свет
Зажёг потухшие сердца
и дал надежду.
Мы пред Тобою предстоим
и каждый дорог для Тебя,
За все, Отец, благодарим
и превозносим.

2   English
Jack and Jill
Went up the hill
To fetch a pail of water
Jack fell down
And broke his crown,
And Jill came tumbling after
Up Jack got,
And home did trot
As fast as he could caper;
To old Dame Dob,
Who patched his nob
With vinegar and brown paper.

3   Chinese
钱唐湖春行

孤山寺北贾亭西
水面初平云脚低
几处早莺争暖树
谁家新燕啄春泥
乱花渐欲迷人眼
浅草才能没马蹄
最爱湖东行不足
绿杨阴里白沙堤

4   Urdu
کبھی تم مجھ سے ملتے ہو
توڑنا مت کرو،

زندگی آپ کے ساتھ جاتا ہے،
مسکر اندر ہے ...

ایم .سرپر میرپوری

5   Hindi
पुष्प की अभिलाषा
- माखनलाल चतुर्वेदी
चाह नहीं मैं सुरबाला के
गहनों में गूँथा जाऊँ
चाह नहीं, प्रेमी-माला में
बिंध प्यारी को ललचाऊँ
चाह नहीं, सम्राटों के शव
पर हे हरि, डाला जाऊँ
चाह नहीं, देवों के सिर पर
चढ़ूँ भाग्य पर इठलाऊँ
मुझे तोड़ लेना वनमाली
उस पथ पर देना तुम फेंक
मातृभूमि पर शीश चढ़ाने
जिस पर जावें वीर अनेक ।।

6   Korean
초겨울 편지/ 김용택

앞산에
고운 잎
다 졌답니다
빈 산을 그리며
저 강에
흰눈
내리겠지요
눈 내리기 전에
한번 보고 싶습니다

7   Tamil
புத்தாண்டு வாழ்த்துக்கள்
பூக்கட்டும் புதுமலர்,
வீசட்டும் நம்மில்!!
இனிக்கட்டும் திருநாள்,
பிறக்கட்டும் புதுசிந்தனை!!
போகட்டும் பகைமை,
இனையட்டும் உறவு!!
விலகட்டும் தாழ்வு,
வாழட்டும் மனிதம்!!
தோன்றட்டும் வாய்ப்பு,
அடையட்டும் இலக்கு!!
பரவட்டும் அமைதி,
மாறட்டும் புதிய புத்தாண்டு!!

8   Marathi
चल माणसा भाकीत कर
मन तुझं उघड कर
जगण्याचा प्रवाह शिथिल कर
सुकर कर सुजय कर

9   Bengali
ঘোর কেটে গেলে
- আবিদ আনোয়ার
হয়তো এখনও আছি অর্ধস্ফুট গোলাপের মতো-- 
বোঝেনি শরীর-সত্তা কাকে বলে পূর্ণ জাগরণ;
দরিদ্র ইন্দ্রিয়গুলো চিনেছে যে বস্তুবাস্তবতা
কখনও জাগ্রত হলে চিনে নিতো আরেক জীবন। 
যদি এ-রহস্যমালা কোনোদিন এই গূঢ় অন্তর্বাস খোলে
হয়তো দেখবো কিছু বর্গক্ষেত্র ঢুকে বসে আছে
অসংগত পৃথিবীর বেমক্কা বর্তুলে:
প্রকৃত রাজার কাঁধে গোলামের তকমা তুলে দিয়ে
গোলাম রাজত্ব করে জগদ্দল প্রভুত্বের পতাকা উড়িয়ে।
দিব্যদৃষ্টি খুলে গেলে তুমি দেখে নিয়ো

10  German
Der Weg nicht genommen:

Zwei Straßen wichen in gelbem Holz aus,
Und tut mir leid, ich konnte nicht beide reisen
Und sei ein Reisender, lange habe ich gestanden
Und schaute so weit ich konnte nach unten
Zu wo es sich im Unterholz verbog;

11  Punjabi
ਲੋਹੜੀ ਦੇ ਗੀਤ

ਸੁੰਦਰ ਮੁੰਦਰੀਏ - ਹੋ
ਸੁੰਦਰ ਮੁੰਦਰੀਏ - ਹੋ!
ਤੇਰਾ ਕੌਣ ਵਿਚਾਰਾ - ਹੋ!
ਦੁੱਲਾ ਭੱਟੀ ਵਾਲਾ - ਹੋ!
ਦੁੱਲੇ ਧੀ ਵਿਆਹੀ - ਹੋ!
ਸੇਰ ਸੱਕਰ ਆਈ - ਹੋ!
ਕੁੜੀ ਦੇ ਬੋਝੇ ਪਾਈ - ਹੋ!
ਕੁੜੀ ਦਾ ਲਾਲ ਪਟਾਕਾ - ਹੋ!
ਕੁੜੀ ਦਾ ਸਾਲੂ ਪਾਟਾ - ਹੋ!
ਸਾਲੂ ਕੌਣ ਸਮੇਟੇ - ਹੋ!
ਚਾਚਾ ਗਾਲ੍ਹੀ ਦੇਸੇ - ਹੋ!
ਚਾਚੇ ਚੂਰੀ ਕੁੱਟੀ - ਹੋ!
ਜ਼ਿੰਮੀਦਾਰਾਂ ਲੁੱਟੀ - ਹੋ!
ਜ਼ਿੰਮੀਦਾਰ ਸਦਾਓ - ਹੋ!
ਗਿਣ ਗਿਣ ਪੌਲੇ ਲਾਓ - ਹੋ!
ਇੱਕ ਪੌਲਾ ਘਟ ਗਿਆ!
ਜ਼ਿਮੀਂਦਾਰ ਨੱਸ ਗਿਆ - ਹੋ!